import React, { Component } from 'react';

class Introduce extends Component {
  render() {
    return (
    <div className="myIntroduce">
      <h2 className="flex flex-center"><span>Introduce</span></h2>
      <p className="f-15">
        私の得意な分野は、空間デザインとUIデザインです。空間デザインは大学の研究室で、UI・UXデザインはベンチャー企業でのインターンシップを通して学びました。
        一見全く関係がないように見えるこの2つの分野ですが「問題解決」という広義のデザインではほとんど同じではないでしょうか。
        問題解決のアウトプットとして、空間なのかwebサイトなのかという違いだけだと思います。<br/>
        そして誤解を恐れずに言うと、私は「問題解決」自体は好きですが、特定の分野に対しての固執はありません。
        それは消極的な理由ではなく、様々な分野に興味があるからです。
        空間デザイン、UI・UXデザインの他にも、インテリア、プロダクト、グラフィックのデザインや、もっと他の分野で言えば、プログラミング、会社経営、経済学、プロジェクトマネジメント、地域活性、心理学、スポーツ、筋肉、栄養学、日本食やワインなど...
        １年前の自分よりも１００倍くらい成長したい、という気持ちで毎日勉強と実践をしています。
        大概は本から知識を吸収するので、毎月家に新しい本が何冊も増えていき、そしてついにスペースが足りなくなったので本棚を自作したくらいです。(笑)
        そうして私は将来的には、沢山の分野の知識と経験を横断的に融合させた特定の分野に縛られない柔軟な発想で、様々な角度から問題を解決できるような人材になりたいです。
      </p>
    </div>
    );
  }
}

export default Introduce ;
