import React, { Component } from 'react';

class Introduce extends Component {
  render() {
    return (
    <div className="myIntroduce">
      <h2 className="flex flex-center"><span>Introduce</span></h2>
      <p className="f-15">
        　はじめまして。
        京都工芸繊維大学大学院 デザイン学専攻 修士1回生の木林将也です。
        <br/><br/>
        　学部時代の４年間は、デザイン経営工学課程という少し珍しい学科に所属していました。
        そこでは名前の通り、デザインとマネジメント、エンジニアリングというものづくりの上流から下流まで幅広く学びました。
        そこで学んだことは具体的な知識や経験ではなく、それぞれの領域を
        <br/><br/>
        　現在は、研究室での活動と、web系企業での長期インターンシップの２つに打ち込んでいます。
        研究室では、オフィスのデザインである『ワークプレイスデザイン』と、プログラミングを駆使して最適解を導く『コンピュテーショナルデザイン』の２つを専攻しています。
        次に長期インターンシップでは、自社開発の『webサービスのデザインやコーディング』を担当しています。
        他にも授業がたくさんあって毎日忙しいですが、実践と勉強の両方がバランスよくできて、非常に充実した日々を送っています。
        <br/><br/>
        　私の将来の目標は、幅広い知見と視野を持って、自分の専門領域に捕らわれずに様々な分野のコラボレーションを促進することのできるデザイナーになることです。
      </p>
    </div>
    );
  }
}

export default Introduce ;
